export const aboutmeData = [
    {
        title: 'WHO AM I 💜',
        content: () => (
            <div>
                <p>
                    PC, Mobile, TV, Tablet 등 다양한 웹 플랫폼 환경에 맞추어 퍼블리싱을 오랫동안 해왔습니다.                    
                </p>
                <p>
                    최근에는 Javascript(특히 React) 언어에 매력을 느끼고 프론트엔드 위주의 프로젝트들에 참여하기 시작하였습니다.
                    주로 React 기반의 개발을 하였고 최근에는 redux-action을 활용하여 redux를 통한 상태관리도 차근차근 적용하고 있습니다.
                </p>
                <br />
                <p>
                    개발을 할 때에는 기획자가 표현하려는 UI,UX와 백엔드에서 개발하기 편한 방식, 그리고 프론트엔드에서 개발하기 적합한 방법을 의논하여 진행합니다. <br />
                    그만큼 서로간의 커뮤니케이션과 정보공유를 중요핟고 생각합니다. <br />
                    최대한 상대방의 의견을 따르려고 하고, 아이디어가 떠오르거나 좋은 의견이 생각나면 나누려고 노력합니다. 
                </p>
            </div>
        )
    },
    {
        title: 'WHAT I LIKE 💜',
        content: () => (
            <div>
                <p>해야 하는 업무의 전체적인 흐름과 목적(사용성)을 파악하고 개발하는 것을 지향하며, 개발과 서비스에 대한 고민하는 것을 좋아합니다. </p>
                <p>시간적 여유가 된다면, 관심이 가는 언어나 기술은 가볍게라도 한 번씩 살펴보려고 합니다.</p>
                <p>아무리 힘들어도 즐겁게 일하는 것을 선호합니다.</p>
            </div>
        )
    },
    {
        title: 'WHAT I WANT 💜',
        content: () => (
            <div>
                <p>
                무조건 기술적으로만 처리하는 개발자가 아닌,  <br />
                서비스와 개발을 전체적으로 바라보는 관점에서 프로젝트가 데이터와 컴퓨터 자료를 더 효율적으로 사용하고, <br />
                사용자에게 가치있는 개발을 생각하는 개발자가 되고자 합니다. 
                </p>
                <br />
                <p>
                    꾸준한 자기개발을 통해 javascript(Node.js)기반의 풀스택 개발자가 되는것을 현재의 목표로 삼고 있으며, <br />
                    탄탄한 기본기와 개발 언어에 장벽이 없는 도구 로써 사용할 줄 아는 멋진 개발자가 되고싶습니다.
                </p>
            </div>
        )
    }
]
