export const aboutmeData = [
    {
        title: 'WHO AM I',
        content: () => (
            <div>
                <p>html, css, 플로그인 활용 위주의 퍼블리싱 개발을 합니다. </p>
                <p>최근 2년동안에는 javascript(특히 React)  위주의 프론트엔드에 빠져 2년 정도는 중간 중간 가능한 프로젝트들에 참여하였습니다. </p>
                <p>React 위주의 퍼블을 주로 시작하고 최근에는 redux-action을 활용하여 redux 를 통한 상태관리도 차근차근 적용하고 있습니다. </p>
                <br />
                <p>기존 업무방식은 기획자가 표현하려는 UI,UX와 백엔드에서 개발하기 적합한 방식, </p>
                <p>그리고 프론트엔드에서 개발하기 적합한 API응답값을 의논하여 개발하였습니다.</p>
            </div>
        )
    },
    {
        title: 'WHAT I LIKE',
        content: () => (
            <div>
                <p>해야 하는 업무의 전체적인 흐름과 목적(사용성)을 파악하고 개발하는 것을 지향하며, 개발과 서비스에 대한 고민하는 것을 좋아합니다. </p>
                <p>시간적 여유가 된다면, 관심이 가는 언어나 기술은 가볍게라도 한 번씩 살펴보려고 합니다.</p>
                <p>아무리 힘들어도 즐겁게 일하는 것을 선호합니다.</p>
            </div>
        )
    },
    {
        title: 'WHAT I WANT',
        content: () => (
            <div>
                <p>
                무조건 기술적으로만 처리하는 개발자가 아닌,  <br />
                서비스와 개발을 전체적으로 바라보는 관점에서 프로젝트가 데이터와 컴퓨터 자료를 더 효율적으로 사용하고, <br />
                사용자에게 가치있는 개발을 생각하는 개발자가 되고자 합니다. 
                </p>
                <br />
                <p>
                    꾸준한 자기개발을 통해 javascript(Node.js)기반의 풀스택 개발자가 되는것을 현재의 목표로 삼고 있으며, <br />
                    탄탄한 기본기와 개발 언어에 장벽이 없는 도구 로써 사용할 줄 아는 멋진 개발자가 되고싶습니다.
                </p>
            </div>
        )
    }
]

